-------------------------------------------------------------------------
General Model Info
-------------------------------------------------------------------------
	Model-Name: stacked_medium_model
	Model-Structure:
		Model: "stacked_medium_model"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		lstm_10 (LSTM)               (None, 4, 16)             1152      
		_________________________________________________________________
		lstm_11 (LSTM)               (None, 8)                 800       
		_________________________________________________________________
		dense_8 (Dense)              (None, 1)                 9         
		=================================================================
		Total params: 1,961
		Trainable params: 1,961
		Non-trainable params: 0
		_________________________________________________________________

	Model-Hyperparameter:
		batch_size: 1
		epochs: 50
		learning_rate: 0.001
		recurrent_dropout: 0.1

-------------------------------------------------------------------------
Mean CV Test-Score (6 Splits) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 47608.2670 

-------------------------------------------------------------------------
Training-Score (Refit Model)
-------------------------------------------------------------------------
	RMSE: 40604.3960 

-------------------------------------------------------------------------
Test-Score (Refit Model) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 23587.3019 
