-------------------------------------------------------------------------
General Model Info
-------------------------------------------------------------------------
	Model-Name: stacked_large_model
	Model-Structure:
		Model: "stacked_large_model"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		lstm_14 (LSTM)               (None, 4, 128)            66560     
		_________________________________________________________________
		lstm_15 (LSTM)               (None, 64)                49408     
		_________________________________________________________________
		dense_10 (Dense)             (None, 1)                 65        
		=================================================================
		Total params: 116,033
		Trainable params: 116,033
		Non-trainable params: 0
		_________________________________________________________________

	Model-Hyperparameter:
		batch_size: 1
		epochs: 150
		learning_rate: 0.001
		recurrent_dropout: 0.1

-------------------------------------------------------------------------
Mean CV Test-Score (6 Splits) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 43899.1130 

-------------------------------------------------------------------------
Training-Score (Refit Model)
-------------------------------------------------------------------------
	RMSE: 18837.4776 

-------------------------------------------------------------------------
Test-Score (Refit Model) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 80085.3877 
