-------------------------------------------------------------------------
General Model Info
-------------------------------------------------------------------------
	Model-Name: single_large_model
	Model-Structure:
		Model: "single_large_model"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		lstm_4 (LSTM)                (None, 256)               264192    
		_________________________________________________________________
		dense_4 (Dense)              (None, 1)                 257       
		=================================================================
		Total params: 264,449
		Trainable params: 264,449
		Non-trainable params: 0
		_________________________________________________________________

	Model-Hyperparameter:
		batch_size: 1
		epochs: 100
		learning_rate: 0.001

-------------------------------------------------------------------------
Mean CV Test-Score (6 Splits) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 51251.3842 

-------------------------------------------------------------------------
Training-Score (Refit Model)
-------------------------------------------------------------------------
	RMSE: 29559.2887 

-------------------------------------------------------------------------
Test-Score (Refit Model) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 29559.2887 
