-------------------------------------------------------------------------
General Model Info
-------------------------------------------------------------------------
	Model-Name: single_medium_model
	Model-Structure:
		Model: "single_medium_model"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		lstm_2 (LSTM)                (None, 8)                 320       
		_________________________________________________________________
		dense_2 (Dense)              (None, 1)                 9         
		=================================================================
		Total params: 329
		Trainable params: 329
		Non-trainable params: 0
		_________________________________________________________________

	Model-Hyperparameter:
		batch_size: 1
		epochs: 200
		learning_rate: 0.001

-------------------------------------------------------------------------
Mean CV Test-Score (6 Splits) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 48675.8986 

-------------------------------------------------------------------------
Training-Score (Refit Model)
-------------------------------------------------------------------------
	RMSE: 37791.6512 

-------------------------------------------------------------------------
Test-Score (Refit Model) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 37075.7188 
