-------------------------------------------------------------------------
General Model Info
-------------------------------------------------------------------------
	Model-Name: stacked_small_model
	Model-Structure:
		Model: "stacked_small_model"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		lstm_6 (LSTM)                (None, 4, 4)              96        
		_________________________________________________________________
		lstm_7 (LSTM)                (None, 2)                 56        
		_________________________________________________________________
		dense_6 (Dense)              (None, 1)                 3         
		=================================================================
		Total params: 155
		Trainable params: 155
		Non-trainable params: 0
		_________________________________________________________________

	Model-Hyperparameter:
		batch_size: 1
		epochs: 150
		learning_rate: 0.001
		recurrent_dropout: 0

-------------------------------------------------------------------------
Mean CV Test-Score (6 Splits) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 43967.7002 

-------------------------------------------------------------------------
Training-Score (Refit Model)
-------------------------------------------------------------------------
	RMSE: 38766.5459 

-------------------------------------------------------------------------
Test-Score (Refit Model) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 36868.5032 
