-------------------------------------------------------------------------
General Model Info
-------------------------------------------------------------------------
	Model-Name: single_small_model
	Model-Structure:
		Model: "single_small_model"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		lstm (LSTM)                  (None, 2)                 32        
		_________________________________________________________________
		dense (Dense)                (None, 1)                 3         
		=================================================================
		Total params: 35
		Trainable params: 35
		Non-trainable params: 0
		_________________________________________________________________

	Model-Hyperparameter:
		batch_size: 1
		epochs: 100
		learning_rate: 0.001

-------------------------------------------------------------------------
Mean CV Test-Score (6 Splits) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 46870.0676 

-------------------------------------------------------------------------
Training-Score (Refit Model)
-------------------------------------------------------------------------
	RMSE: 44424.1684 

-------------------------------------------------------------------------
Test-Score (Refit Model) (8 Test Periods each)
-------------------------------------------------------------------------
	RMSE: 24463.8177 
